namespace ElectronicDiary.Notes;

public class ToDo
{
    // Todo сделать миграцию
    // Todo проверить проверки где возвращается BaseResponse на a == null или a != null, должно быть a.Data
    // Todo проверить работоспособность всех запросов, а так же маппинг моделей
    // Todo заполнить БД полезной нагрузкой
    // Todo добавить выгрузку "расписание на завтра" в виде excel
    // Todo добавить в токен больше полезной нагрузки
    // Todo разграничить запросы на права (подумать насчёт политик) как указанно в задании
}